In [1]:
import pandas as pd

In [5]:
data = pd.read_csv('Churn_Modelling.csv')
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [63]:
x = data.loc[ :, "CreditScore" : "EstimatedSalary" ]
y = data.loc[ :, 'Exited' ]

In [64]:
x

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,France,Female,42,2,0.00,1,1,1,101348.88
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58
2,502,France,Female,42,8,159660.80,3,1,0,113931.57
3,699,France,Female,39,1,0.00,2,0,0,93826.63
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...,...,...
9995,771,France,Male,39,5,0.00,2,1,0,96270.64
9996,516,France,Male,35,10,57369.61,1,1,1,101699.77
9997,709,France,Female,36,7,0.00,1,0,1,42085.58
9998,772,Germany,Male,42,3,75075.31,2,1,0,92888.52
9999,792,France,Female,28,4,130142.79,1,1,0,38190.78

In [65]:
y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [66]:
x.dtypes

CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
dtype: object

In [67]:
from sklearn.preprocessing import LabelEncoder

In [68]:
le = LabelEncoder()

In [69]:
print( x['Geography'].unique() )

['France' 'Spain' 'Germany']

In [70]:
x['Geography'] = le.fit_transform( x['Geography'] )
x['Geography']
print( x['Geography'].unique() )

[0 2 1]

In [71]:
print( x['Gender'].unique() )

['Female' 'Male']

In [72]:
x['Gender'] = le.fit_transform( x['Gender'] )
x['Gender']
print( x['Gender'].unique() )

[0 1]

In [73]:
x.dtypes

CreditScore          int64
Geography            int32
Gender               int32
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
dtype: object

In [74]:
y.dtypes

dtype('int64')

In [75]:
x.head()

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,2,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57
3,699,0,0,39,1,0.00,2,0,0,93826.63
4,850,2,0,43,2,125510.82,1,1,1,79084.10

In [76]:
y.head()

0    1
1    0
2    1
3    0
4    0
Name: Exited, dtype: int64

In [77]:
from sklearn.model_selection import train_test_split

In [78]:
x_train, x_test, y_train, y_test = train_test_split( x, y, test_size = 0.2 )

In [79]:
x_train

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
734,545,1,0,60,7,128981.07,1,0,1,176924.21
704,659,1,1,36,2,76190.48,2,1,1,149066.14
2763,706,1,0,47,6,120621.89,1,1,1,140803.70
7973,592,1,1,31,7,124593.23,1,1,0,86079.67
6736,707,0,0,57,1,92053.00,1,1,1,164064.44
...,...,...,...,...,...,...,...,...,...,...
1098,790,0,0,26,4,141581.71,2,0,0,98309.27
9606,524,0,1,44,10,118569.03,2,0,0,82117.20
7089,635,2,0,48,2,0.00,2,1,1,136551.25
927,639,1,1,38,5,130170.82,1,1,1,149599.62
9242,612,1,1,32,9,106520.73,2,1,0,177092.16

In [80]:
x_test

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
1932,655,2,0,56,5,0.00,2,1,1,41782.70
9816,643,2,1,48,8,0.00,2,1,0,174729.30
8188,506,1,0,59,3,190353.08,1,1,0,78365.75
4876,657,2,0,27,8,0.00,2,0,0,6468.24
8089,692,1,1,24,2,120596.93,1,0,1,180490.53
...,...,...,...,...,...,...,...,...,...,...
8580,529,0,0,31,6,152310.55,1,1,0,13054.25
1180,621,0,1,34,6,0.00,2,1,1,99128.13
9271,649,2,0,47,8,110783.28,1,1,1,71420.16
6674,654,0,1,36,2,112262.84,1,1,0,12873.39
3149,643,2,0,34,8,117451.47,1,1,0,65374.86

In [81]:
y_test

1932    0
9816    0
8188    0
4876    0
8089    0
       ..
8580    0
1180    0
9271    0
6674    0
3149    0
Name: Exited, Length: 2000, dtype: int64

In [82]:
y_train

734     1
704     0
2763    0
7973    0
6736    1
       ..
1098    0
9606    0
7089    0
927     0
9242    0
Name: Exited, Length: 8000, dtype: int64

In [83]:
from xgboost import XGBRFClassifier

In [84]:
xgbob = XGBRFClassifier()
xgbob

XGBRFClassifier(base_score=0.5, colsample_bylevel=1, colsample_bynode=0.8,
                colsample_bytree=1, gamma=0, learning_rate=1, max_delta_step=0,
                max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
                n_jobs=1, nthread=None, objective='binary:logistic',
                random_state=0, reg_alpha=0, reg_lambda=1, scale_pos_weight=1,
                seed=None, silent=None, subsample=0.8, verbosity=1)

In [85]:
xgbob.fit( x_train, y_train )

XGBRFClassifier(base_score=0.5, colsample_bylevel=1, colsample_bynode=0.8,
                colsample_bytree=1, gamma=0, learning_rate=1, max_delta_step=0,
                max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
                n_jobs=1, nthread=None, objective='binary:logistic',
                random_state=0, reg_alpha=0, reg_lambda=1, scale_pos_weight=1,
                seed=None, silent=None, subsample=0.8, verbosity=1)

In [90]:
y_pred = xgbob.predict( x_test )
y_pred

array([0, 0, 1, ..., 0, 0, 0], dtype=int64)

In [92]:
pd.DataFrame( y_pred )

      0
0     0
1     0
2     1
3     0
4     0
...  ..
1995  0
1996  0
1997  0
1998  0
1999  0

[2000 rows x 1 columns]

In [93]:
from sklearn.metrics import confusion_matrix

In [94]:
cm = confusion_matrix( y_test, y_pred )

In [95]:
cm

array([[1563,   49],
       [ 215,  173]], dtype=int64)

In [97]:
correct = cm[0][0] + cm[1][1]
correct

1736

In [98]:
wrong = cm[0][1] + cm[1][0]
wrong

264

In [101]:
accuracy = correct/ ( correct+wrong )
accuracy

0.868

In [124]:
"""
We can find accuracy using cross validation also by importing cross_val_score.
"""

'\nWe can find accuracy using cross validation also by importing cross_val_score.\n'

In [125]:
from sklearn.model_selection import cross_val_score

In [128]:
cv = cross_val_score( estimator = xgbob, X = x_train, y = y_train, cv = 10 )
cv

array([0.84144819, 0.845     , 0.84375   , 0.86      , 0.8525    ,
       0.84875   , 0.86      , 0.84875   , 0.8475    , 0.86483104])

In [129]:
print( f"cv.mean() = { cv.mean() }")
print( f"cv.mean() * 100 = { cv.mean() * 100 }")

cv.mean() = 0.8512529228561295
cv.mean() * 100 = 85.12529228561296

In [132]:
print( f"cv.std() = { cv.std() }")
print( f"cv.std() * 100 = { cv.std() * 100 }")              #std is the standard deviation.

cv.std() = 0.007463796040498287
cv.std() * 100 = 0.7463796040498287

In [133]:
print( f"Accuracy Range is from { ( cv.mean()-cv.std() ) * 100 } to { ( cv.mean()+cv.std() ) * 100 }" )

Accuracy Range is from 84.37891268156312 to 85.87167188966278